
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ChemDoodle.</string>
    <key>Identifier</key>
    <string>com.github.wholtz.chemdoodle.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ChemDoodle</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.chemdoodle.com/download/</string>
                <key>re_pattern</key>
                <string>ChemDoodle-osx-(?P&lt;raw_version&gt;[0-9\.\-]+)\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.chemdoodle.com/downloads/ChemDoodle-osx-%raw_version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
